$(function () {
  //  写稿子时，务必突出这一点，同一套数据，可以任意切换不同的展示

  // 由于所有属性或大部分属性，均非覆盖原属性值，而是利用这些属性值重新拼接属性，故这些属性均以下划线开头
  mf.echarts.bar({
    _x: ["衬衫", "羊毛衫", "雪纺衫", "裤子", "高跟鞋", "袜子"],
    _legend: ['销量'],
    _data: [5, 20, 40, 10, 10, 20],    
  });
  mf.echarts.ring({
    _id: 'chartWrap2',
    _legend: ['直接访问', '邮件营销', '联盟广告'],
    _data: [{ value: 335, name: '直接访问' }, { value: 310, name: '邮件营销' }, { value: 234, name: '联盟广告' }, { value: 135, name: '视频广告' }, { value: 548, name: '搜索引擎' }]
  });
});


